NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/system/exterior/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss upwind;

    div(phi,K)      Gauss linear;
    div(phi,h)      Gauss upwind;

    turbulence      Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian((rho*nuEff),U) Gauss linear corrected;
    laplacian((rho*DkEff),k) Gauss linear corrected;
    laplacian((rho*DomegaEff),omega) Gauss linear corrected;
    laplacian(rhorAUf,p_rgh) Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
